---
kind: type
id: T:Autodesk.Revit.DB.SSEPointVisibilitySettings
source: html/5bd4779b-340d-8509-2376-1f97f828bf42.htm
---
# Autodesk.Revit.DB.SSEPointVisibilitySettings

Represents the settings contained in the document associated to the point display of Floor, Roof and Toposolid.
 for serialization
 public api methods

## Syntax (C#)
```csharp
public class SSEPointVisibilitySettings : Element
```